{
    "apps": [{
        "title": "OpenShift Everywhere",
        "presenter": "Max Shapiro",
        "abstract": "Learn how to use and interact with Openshift as a developer. In this session, we will compare and deploy the Bee Travels application to Openshift on IBM Cloud and on other Clouds.",
        "related": ["OpenShift"]
    }, {
        "title": "Quarkus - Supersonic Subatomic Java",
        "presenter": "Anamarija Talijanac",
        "abstract": "Dive into the next generation cloud native framework for running Java in microservice oriented cloud platforms.",
        "related": ["OpenShift", "Java", "Serverless"]
    }, {
        "title": "Digital Transformation of Legacy Applications",
        "presenter": "Kenishia Callaway",
        "abstract": "As the world marches towards the use of open systems and open source as the models for integration, see how IBM Z can remain in lock step. See a demo on how a Node.js healthcare application created for millennials by millennials is integrating with CICS and Db2 on the mainframe without the need for legacy skills.",
        "related": ["OpenShift", "Z"]
    }, {
        "title": "Introduction to Kubernetes Operators",
        "presenter": "Jonathan Berkhahn",
        "abstract": "This presentation will cover the internal architecture of an operator, and go over some tools that can be used to quickly stand up an operator.",
        "related": ["Kubernetes", "OperatorHub"]
    }, {

        "title": "Learn to build your own Helm Charts",
        "presenter": "Mofizur Rahman",
        "abstract": "In this session we will go over how you can use helm to install kubernetes application as well as create your own helm chart for you application.",
        "related": ["Openshift"]
    }, {
        "title": "Building reactive java applications ready for an event-centric world",
        "presenter": "Grace Jansen",
        "abstract": "In this workshop you'll learn what it means to easily build a cloud-native, asynchronous, reactive application through the Eclipse MicroProfile reactive APIs and Apache Kafka.",
        "related": ["Java", "Kafka"]
    }, {
        "title": "Supercharging the Developer Experience with an enriched API Hub from IBM",
        "presenter": "Paul J Gordon",
        "abstract": "",
        "related": ["API Hub"]
    }, {
        "title": "Microservices for Beginners",
        "presenter": "Niklas Heidloff",
        "abstract": "For this session, we use our example code cloud-native-starter, which we have released on GitHub as open source, along with scripts for fast deployments to Minikube and lots of instructions and information.",
        "related": ["kubernetes", "java"]
    }, {
        "title": "Modern Web Apps with Rust, Node, and OpenShift",
        "presenter": "Josh Hannaford",
        "abstract": "In this presentation, we will discuss some of the benefits of using Rust to supplement, or even in some cases, replace existing Node applications when performance is a key factor. Some of the key topics include: when to use Rust, how it can supplement existing web applications, and deployment on OpenShift.",
        "related": ["OpenShift", "node"]
    }, {
        "title": "Transforming an Idea into an Experience with Agile and Design Thinking",
        "presenter": "Sharon Wang & Brittny Laporte",
        "abstract": "What exactly do Design Thinking, Rapid Prototyping, and Agile entail? We'll demystify these concepts, and provide you with a flexible and easy approach so that you can apply them in your own project, to transform an idea into an experience that is valuable to users.",
        "related": ["openshift", "appid"]
    }, {
        "title": "Build and Deploy a Full Stack Cloud App in 25 Minutes",
        "presenter": "Sharon Wang & Igor Braga",
        "abstract": "Rapid creation of a Java based microservice architecture for a mobile app. Includes some early thinking about privacy by design.",
        "related": ["openshift", "tekton" ]
    }],
    "ops": [{
        "title": "Docker containers for Front-End development runtimes.",
        "presenter": "Dawn Ahukanna",
        "abstract": "Run different langauges for different versions of applications, have this automated and fully scripted, with a web-based dashboard for all your dev environments.",
        "related": ["Docker", "Node"]
    }, {
        "title": "Turn a Kubernetes deployment into a Knative service",
        "presenter": "Tara Gu",
        "abstract": "By showing how to turn an existing Kubernetes deployment into a Knative service. this presentation shows how much easier it is to create a Knative service versus a Kubernetes deployment. ",
        "related": ["kubernetes", "knative"]
    }, {
        "title": "Streamline software deploys with Red Hat Marketplace",
        "presenter": "Rojan Jose",
        "abstract": "Red Hat Marketplace is an open cloud marketplace that makes it easier to discover and access certified software for container-based environments in public clouds and on-prem.",
        "related": ["Red Hat Marketplace"]
    }, {
        "title": "Cloud Native CD Pipelines with Tekton",
        "presenter": "Andrea Frittoli",
        "abstract": "We will present how Tekton pipelines, combined with triggers and cloud events, are used to implement the CD pipelines that build, release and deploy Tekton itself.",
        "related": ["tekton"]
    }, {
        "title": "Extending Kubernetes Scheduler - Everything You Need to Know",
        "presenter": "Huang-Wei",
        "abstract": "This talk will give an intorduction on various ways of extending Kubernetes scheduler, to ensure end-users' diverse workloads can fit on the same platform, so as to achieve high cluster utilization and application high availability.",
        "related": ["kubernetes"]
    }, {
        "title": "Lessons learned on running Jenkins in openshift",
        "presenter": "Michele Buccarello",
        "abstract": "In this talk I will share what I learned about Jenkins in Openshift. The session will end with a summary about the best practice I followed and the problems I faced and how we solved.",
        "related": ["openshift"]
    }, {
        "title": "IBM Cloud Satellite: IBM Cloud Anywhere You Need It",
        "presenter": "Vanessa Wilburn",
        "abstract": "Engineering teams can gain the flexibility to run their applications where it makes sense, for example low latency access to on-prem systems, local data processing, or local data storage. With this offering, you get to focus on app development, not platform differences.",
        "related": ["Cloud Satellite"]
    }, {
        "title": "The Community Behind the Meteoric Rise of the Kubernetes Project",
        "presenter": "Sahdev P. Zala",
        "abstract": "In this talk, I will provide an insight of the Kubernetes community, it’s amazing culture, structure and values. While mesmerizing with interesting facts, you will also learn how to get involved and become part of this amazing community, and how to climb the contributor ladder.",
        "related": ["kubernetes"]
    }, {
        "title": "Cloud Native Application Monitoring Tools",
        "presenter": "Max Shapiro",
        "abstract": "Learn the best practices for a cloud native application development life cycle. In this session, attendees will learn about what the Bee Travels project is, how it works, and the life cycle of Bee Travels from coding to deploying the application.",
        "related": ["OpenShift"]
    }, {
        "title": "",
        "presenter": "",
        "abstract": "",
        "related": []
    }, {
        "title": "",
        "presenter": "",
        "abstract": "",
        "related": []
    }]
}