{
    "apps": [{
        "title": "Modern Development — How Containers are Changing Everything",
        "presenter": "Steve Poole",
        "abstract": "This session will help you get a clearer view of the choices coming your way — from new platforms like Knative or Jenkins X through emerging event-based application architectures to new open source development tools designed to help manage the new complexities of being a developer. We’ll explore the principles behind these tools, why they are important and educate you on what you should be learning.",
        "related": ["kubernetes", "java"]
    },{
        "title": "Quarkus - Supersonic Subatomic Java",
        "presenter": "Anamarija Talijanac",
        "abstract": "Dive into the next generation cloud native framework for running Java in microservice oriented cloud platforms.",
        "related": ["OpenShift", "Java", "Serverless"]
    },{
        "title": "Microservices made easy with MicroProfile, OpenJ9, Open Liberty and OpenShift",
        "presenter": "Jamie Coleman",
        "abstract": "Microservices, microservices, microservices! When you start planning a microservice project there are many more things that need to be considered that simply was not required when creating monoliths. This talk will talk you through a truly open source, cloud-native stack starting at the bottom with OpenShift, then onto the JVM with OpenJ9, Open Liberty as the cloud-native application server then finally MicroProfile as the Java spec for microservices.",
        "related": ["Openshift"]
    },{
        "title": "Introduction to Kubernetes Operators",
        "presenter": "Jonathan Berkhahn",
        "abstract": "This presentation will cover the internal architecture of an operator, and go over some tools that can be used to quickly stand up an operator.",
        "related": ["Kubernetes", "OperatorHub"]
    },{
        "title": "Turn a Kubernetes deployment into a Knative service",
        "presenter": "Tara Gu",
        "abstract": "By showing how to turn an existing Kubernetes deployment into a Knative service. this presentation shows how much easier it is to create a Knative service versus a Kubernetes deployment. ",
        "related": ["kubernetes", "knative"]
    }, {
        "title": "Digital Transformation of Legacy Applications",
        "presenter": "Kenishia Callaway",
        "abstract": "As the world marches towards the use of open systems and open source as the models for integration, see how IBM Z can remain in lock step. See a demo on how a Node.js healthcare application created for millennials by millennials is integrating with CICS and Db2 on the mainframe without the need for legacy skills.",
        "related": ["OpenShift", "Z"]
    }, {
        "title": "Managing Kubernetes with Istio",
        "presenter": "Mofizur Rahman",
        "abstract": "Microservices and containers changed application design and deployment patterns, but along with them brought challenges like service discovery, routing, failure handling, security and visibility to microservices. In this talk we will see how istio can be used to manage traffic, gather metrics and enforce policies in a demo application running microservices. We will learn why kubernetes need “service mesh” and how does Istio improve managing Kubernetes workload.",
        "related": ["Openshift"]
    }, {
        "title": "Building reactive java applications ready for an event-centric world",
        "presenter": "Grace Jansen",
        "abstract": "In this workshop you'll learn what it means to easily build a cloud-native, asynchronous, reactive application through the Eclipse MicroProfile reactive APIs and Apache Kafka.",
        "related": ["Java", "Kafka"]
    }, {
        "title": "Modern Web Apps with Rust, Node, and OpenShift",
        "presenter": "Josh Hannaford",
        "abstract": "In this presentation, we will discuss some of the benefits of using Rust to supplement, or even in some cases, replace existing Node applications when performance is a key factor. Some of the key topics include: when to use Rust, how it can supplement existing web applications, and deployment on OpenShift.",
        "related": ["OpenShift", "node"]
    }, {
        "title": "Transforming an Idea into an Experience with Agile and Design Thinking",
        "presenter": "Sharon Wang & Brittny Laporte",
        "abstract": "What exactly do Design Thinking, Rapid Prototyping, and Agile entail? We'll demystify these concepts, and provide you with a flexible and easy approach so that you can apply them in your own project, to transform an idea into an experience that is valuable to users.",
        "related": ["openshift", "appid"]
    }, {
        "title": "Build and Deploy a Full Stack Cloud App in 25 Minutes",
        "presenter": "Sharon Wang & Igor Braga",
        "abstract": "Rapid creation of a Java based microservice architecture for a mobile app. Includes some early thinking about privacy by design.",
        "related": ["openshift", "tekton" ]
    }],
    "ops": [{
        "title": "Docker containers for Front-End development runtimes.",
        "presenter": "Dawn Ahukanna",
        "abstract": "Run different langauges for different versions of applications, have this automated and fully scripted, with a web-based dashboard for all your dev environments.",
        "related": ["Docker", "Node"]
    }, {
        "title": "Using Openshift on Different Clouds",
        "presenter": "Max Shapiro",
        "abstract": "Learn how to use and interact with Openshift as a developer. In this session, we will compare and deploy the Bee Travels application to Openshift on IBM Cloud and on other Clouds.",
        "related": ["OpenShift"]
    }, {
        "title": "Developer experience with Red Hat Marketplace",
        "presenter": "Rojan Jose",
        "abstract": "Red Hat Marketplace is an open cloud marketplace that makes it easier to discover and access certified software for container-based environments in public clouds and on-prem.",
        "related": ["Red Hat Marketplace"]
    }, {
        "title": "Cloud Native CD Pipelines with Tekton",
        "presenter": "Andrea Frittoli",
        "abstract": "We will present how Tekton pipelines, combined with triggers and cloud events, are used to implement the CD pipelines that build, release and deploy Tekton itself.",
        "related": ["tekton"]
    }, {
        "title": "Extending Kubernetes Scheduler - Everything You Need to Know",
        "presenter": "Huang-Wei",
        "abstract": "This talk will give an intorduction on various ways of extending Kubernetes scheduler, to ensure end-users' diverse workloads can fit on the same platform, so as to achieve high cluster utilization and application high availability.",
        "related": ["kubernetes"]
    }, {
        "title": "Lessons learned on running Jenkins in openshift",
        "presenter": "Michele Buccarello",
        "abstract": "In this talk I will share what I learned about Jenkins in Openshift. The session will end with a summary about the best practice I followed and the problems I faced and how we solved.",
        "related": ["openshift"]
    }, {
        "title": "IBM Cloud Satellite: IBM Cloud Anywhere You Need It",
        "presenter": "Vanessa Wilburn",
        "abstract": "Engineering teams can gain the flexibility to run their applications where it makes sense, for example low latency access to on-prem systems, local data processing, or local data storage. With this offering, you get to focus on app development, not platform differences.",
        "related": ["Cloud Satellite"]
    }, {
        "title": "Code Engine - One platform to rule them all",
        "presenter": "Doug Davis",
        "abstract": "With Code Engine you can deploy a wide variety of runtime artifacts: 12-factor and serverless apps, batch jobs and more. All within one easy to use environment, with the most popular runtime options you'd expect, such as self-managed networking with built-in security and auto-scaling, even down to zero. In this session you'll get a quick overview of the product and a demo showcasing just how easy managing your applications is supposed to be.",
        "related": ["knative"]
    }, {
        "title": "Istio Secure",
        "presenter": "Lee Zhang",
        "abstract": "You learn how to secure your application and microservices without modifying your code in this session. You learn how Istio security can improve security for your application - Security by default: no changes needed to application code and infrastructure - Defense in depth: integrate with existing security systems to provide multiple layers of defense - Zero-trust network: build security solutions on distrusted networks",
        "related": ["OpenShift"]
    }, {
        "title": "Build Accessible Applications with the Equal Access Toolkit",
        "presenter": "Anam Mahmood",
        "abstract": "Through the Equal Access Toolkit, we would like to raise awareness about making websites and applications more accessible and that accessibility is about inclusion, considering everyone whether people with disabilities, different ages, people using mobile devices, or users with slow network connections. With IBM Equal Access Toolkit we can make our software products accessible by including accessibility directly into our workflow as developers and help improve peoples’ lives.",
        "related": ["Openshift"]
    }, {
        "title": "Continuous Integration meets Application Integration!",
        "presenter": "Andy Garratt",
        "abstract": "Many CI/CD practices are well known - but how do they apply when 'Integration' itself is the primary deliverable? Come and join our guided tour to show you where the challenges are, how to overcome them with proven good practices and show that it really works in a live demo with APIs, Queues, Mediations, Connectors, Databases and more!",
        "related": []
    }]
}